Revit 2024 API
RevisionsOnSheetUIServiceData.GetRevitElementIds Method
 return the list of revit Element Ids
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<ElementId> GetRevitElementIds()
Visual Basic
Public Function GetRevitElementIds As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetRevitElementIds()
See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace